In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model
df=pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [2]:
import pandas as pd
df=pd.read_csv('hiring.csv')
values={'five':5,'two':2,'seven':7,'three':3,'ten':10,'eleven':11}
df=df.replace({"experience":values})
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         NaN                    8.0                           9      50000
1         NaN                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    NaN                           7      72000
7        11.0                    7.0                           8      80000

In [3]:
df.experience.mean()

6.333333333333333

In [4]:
df.experience=df.experience.fillna(df.experience.mean())
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0    6.333333                    8.0                           9      50000
1    6.333333                    8.0                           6      45000
2    5.000000                    6.0                           7      60000
3    2.000000                   10.0                          10      65000
4    7.000000                    9.0                           6      70000
5    3.000000                    7.0                          10      62000
6   10.000000                    NaN                           7      72000
7   11.000000                    7.0                           8      80000

In [5]:
new_df=df.rename(columns={'test_score(out of 10)':'test_score','salary($)':'salary'})
new_df.test_score=new_df.test_score.fillna(new_df.test_score.mean())
new_df

   experience  test_score  interview_score(out of 10)  salary
0    6.333333    8.000000                           9   50000
1    6.333333    8.000000                           6   45000
2    5.000000    6.000000                           7   60000
3    2.000000   10.000000                          10   65000
4    7.000000    9.000000                           6   70000
5    3.000000    7.000000                          10   62000
6   10.000000    7.857143                           7   72000
7   11.000000    7.000000                           8   80000

In [6]:
from sklearn import linear_model
reg=linear_model.LinearRegression()
reg.fit(new_df.drop('salary',axis='columns'),new_df.salary)

LinearRegression()

In [7]:
reg.predict([[6,8,9]])

array([65430.60711788])

In [8]:
reg.coef_

array([2633.0537639 , 1203.95910777, 2787.82004231])

In [9]:
reg.intercept_

14910.231291544951

In [10]:
2633.0537639*6+1203.95910777*8+ 2787.82004231*9+14910.231291544951

65430.60711789496